In [1]:
import pandas as pd

In [2]:
insurance_data = pd.read_csv('insurance.csv')
insurance_data.head(10)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520
5   31  female  25.740         0     no  southeast   3756.62160
6   46  female  33.440         1     no  southeast   8240.58960
7   37  female  27.740         3     no  northwest   7281.50560
8   37    male  29.830         2     no  northeast   6406.41070
9   60  female  25.840         0     no  northwest  28923.13692

In [3]:
insurance_data.shape

(1338, 7)

In [4]:
insurance_data.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

In [5]:
insurance_data.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [13]:
insurance_data.sex.unique()

array(['female', 'male'], dtype=object)

In [6]:
# Get the regionwise average insurance charges

In [14]:
round(insurance_data.groupby('region')['charges'].mean())

region
northeast    13406.0
northwest    12418.0
southeast    14735.0
southwest    12347.0
Name: charges, dtype: float64

In [15]:
# Get the region and sexwise average insurance charges

In [19]:
round(insurance_data.groupby(['region','sex'])['charges'].mean())

region     sex
northeast  female    12953.0
           male      13854.0
northwest  female    12480.0
           male      12354.0
southeast  female    13500.0
           male      15880.0
southwest  female    11274.0
           male      13413.0
Name: charges, dtype: float64

In [20]:
# Pivot table

In [21]:
region_wise_insurance_charges = insurance_data[['region','sex','charges','children']]
pd.pivot_table(region_wise_insurance_charges ,values='charges', index='children', columns='region', aggfunc='mean')

region       northeast     northwest     southeast     southwest
children
0         11626.462658  11324.370919  14309.868378  11938.504986
1         16310.206403  10230.256309  13687.041971  10406.484953
2         13615.152722  13464.314687  15728.470623  17483.485559
3         14409.913296  17786.160672  18449.846015  10402.442259
4         14485.193120  11347.018725  14451.023972  14933.260533
5          6978.973483   8965.795750  10115.441542   8444.158625

In [22]:
# Cross tab

In [23]:
#It explains the frequency of occurrence of the categorical data we give as index.

In [24]:
pd.crosstab(index = insurance_data.region,columns = insurance_data.sex,margins=True)

sex        female  male   All
region
northeast     161   163   324
northwest     164   161   325
southeast     175   189   364
southwest     162   163   325
All           662   676  1338

In [25]:
pd.crosstab(index = insurance_data.sex,columns = insurance_data.children,margins=True)

children    0    1    2    3   4   5   All
sex
female    289  158  119   77  11   8   662
male      285  166  121   80  14  10   676
All       574  324  240  157  25  18  1338

In [26]:
# groupby and pivot table - categories and numbers to find mean
# crosstab - categories --> It returns the number of occurences.